Мюнцкабинент_30/src/Documents/Перемещение/Перемещение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Перемещение</name>
  <comment>Перемещение монет между альбомами</comment>
  <registerRecords>AccumulationRegister.ДвиженияМонет</registerRecords>
  <attributes>
    <name>КоллекцияТекущая</name>
    <type>
      <types>CatalogRef.Коллекции</types>
    </type>
  </attributes>
  <attributes>
    <name>КоллекцияПриемник</name>
    <type>
      <types>CatalogRef.Коллекции</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Монеты</name>
    <attributes>
      <name>Монета</name>
      <type>
        <types>CatalogRef.Монеты</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Мюнцкабинент_30/src/AccumulationRegisters/ДвиженияМонет/ДвиженияМонет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДвиженияМонет</name>
  <comment>Приходные и расходные операции с монетами</comment>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <comment>Фактически себестоимость единицы</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.Монеты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Коллекция</name>
    <type>
      <types>CatalogRef.Коллекции</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Мюнцкабинент_30/src/Documents/Перемещение/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ДвиженияМонет 
	Движения.ДвиженияМонет.Записывать = Истина;
	Для Каждого ТекСтрокаМонеты Из Монеты Цикл
		Движение = Движения.ДвиженияМонет.Добавить();
		Движение.ВидДвижения 		= ВидДвиженияНакопления.Расход;
		Движение.Период 			= Дата;
		Движение.Объект 			= ТекСтрокаМонеты.Монета;
		Движение.Коллекция 			= КоллекцияТекущая;
		Движение.Количество 		= ТекСтрокаМонеты.Количество;
		Движение.Стоимость			= ТекСтрокаМонеты.Стоимость;
		//
		Движение = Движения.ДвиженияМонет.Добавить();
		Движение.ВидДвижения 		= ВидДвиженияНакопления.Приход;
		Движение.Период 			= Дата;
		Движение.Объект 			= ТекСтрокаМонеты.Монета;
		Движение.Коллекция 			= КоллекцияПриемник;
		Движение.Количество 		= ТекСтрокаМонеты.Количество;
		Движение.Стоимость			= ТекСтрокаМонеты.Стоимость;
		
	КонецЦикла;

КонецПроцедуры
